import React, { useContext } from "react";
import Button from "../../../../components/form/Button";
import Modal_context from "../../../../context/Modal_context";

const Assurance = () => {
  const MODAL_CONTEXT = useContext(Modal_context);

  return (
    <div className="modal_box_div">
      <h2>چه مدارک و ضمانت‌هایی بگیریم</h2>
      <div className="modal_scroll_section">
        <p>
          در سایت اتولی هر میزبان می‌تواند شرایط متفاوتی برای اجاره ماشینش
          بگذارد که بسته به نوع ماشین می‌تواند متفاوت باشد، به صورت کلی
          می‌توانید مدارک و ضمانت‌های زیر را برای اجاره خودروتان از مشتری
          بگیرید، اما این نکته را در نظر داشته باشید که مدارک و ضمانت‌های زیاد
          می‌تواند میزان درخواست‌های اجاره خودرو شما را کاهش بدهد.
        </p>
        <ul>
          <li>
            مدارک شناسایی معتبر مانند کارت ملی یا شناسنامه و در صورتی که اتباع
            خارجی یا گردشگر هستند پاسپورت.
          </li>
          <li>گواهینامه معتبر که حداقل ۶ ماه دارای اعتبار باشد.</li>
          <li>
            بیمه‌نامه اجاره خودرو (در زمان درخواست اجاره خودرو می‌تواند تهیه
            کند. توصیه می‌شود مشتریانی که این بیمه‌نامه را خریداری می‌کنند در
            اولویت قبول درخواست قرار دهید.)
          </li>
          <li>
            در نظر گرفتن شرایط سنی (پیشنهاد می‌شود که حداقل سن ۲۵ سال را در نظر
            بگیرید.)
          </li>
          <li>
            چک یا سفته به میزان مورد نیاز(معمولا به مبلغ ماشین گرفته می‌شود)
          </li>
          <li>
            ودیعه نقدی: با توجه به نوع ماشین می‌توانید مقداری پول نقد از مشتری
            بابت خسارت‌های احتمالی بگیرید.
          </li>
        </ul>
      </div>
      <Button
        loading={false}
        value="بستن"
        class="Blue_BTN local_Style"
        click={() => MODAL_CONTEXT.modalHandler()}
      />
    </div>
  );
};

export default Assurance;
